jQuery.gvalidation.errors = jQuery.extend(jQuery.gvalidation.errors, {
	required: "Задължително за попълване поле.",
	alpha: "Това поле е само за букви.",
	alphanum: "Това поле е само за букви и числа.",
	nodigit: "Това поле не може да съдържа числа.",
	digit: "Моля въведете число.",
	digitmin: "Числото не може да бъде по-малко от %1",
	digitltd: "Числото трябва да е повече от %1 и по-малко от %2",
	number: "Моля въведете число.",
	email: "Моля въведете правилен email: <br /><span>Например yourname@domain.com</span>",
	phone: "Моля въведете правилен телефон.",
	url: "Моля въведете правилен адрес: <br /><span>Например http://www.domain.com</span>",
	
	confirm: "Полето трябва да е едно и също с поле %1",
	differs: "Числото трябва да се различава от %1",
	length_str: "Дължината на написаното трябва да е минимум %1 и максимум %2 символа",
	length_fix: "Дължината е неправилна, трябва да е точно %1 символа",
	lengthmax: "Попълнете полето, като внимавате да не превишите %1 символа",
	lengthmin: "Попълнете полето, като напишете поне %1 символа",
	checkbox: "Моля селектирайте чек-бокс опцията",
	group: 'Please make at least %1 selection(s).',
	custom: "Моля изберете един от вариантите",
	select: "Моля изберете един или повече от вариантите"
});