/**
 * FormCheck Persian Language
 *
 * author
 *      Amir Hossein Hodjati Pour ~ Boplo.ir
*/
jQuery.gvalidation.errors = jQuery.extend(jQuery.gvalidation.errors, {
        required:"این فیلد الزامی است.",
        alpha:"لطفا فقط از حروف الفباء برای این بخش استفاده کنید. کاراکترهای دیگر و فاصله مجاز نیستند.",
        alphanum:"لطفا فقط از حروف الفباء و اعداد در این بخش استفاده کنید. کاراکترهای دیگر و فاصله مجاز نیستند.",
        nodigit: "لطفا عدد وارد نکنید.",
        digit: "لطفا یک عدد صحیح وارد کنید.",
        digitmin: "عدد باید بزرگتر از %1 باشد.",
        digitltd: "عدد باید بین %1 و 1% باشد.",
        number: "لطفا یک عدد معتبر وارد کنید.",
        email: "لطفا یک ایمیل معتبر وارد کنید: <br /><span>نمونه: yourn...@domain.com</span>",
        image : "لطفا فقط تصویر انتخاب کنید.",
        phone: "لطفا یک شماره تلفن معتبر وارد کنید.",
        url: "لطفا یک URL صحیح وارد کنید: <br /><span>نمونه: http://www.domain.com</span>",

        confirm: "این بخش با %1 متفاوت است.",
        differs: "این بخش باید با %1 متفاوت باشد.",
        length_str: "طول مقدار وارد شده صحیح نیست و باید بین %1 و %2 کاراکتر باشد.",
        length_fix: "طول مقدار وارد شده صحیح نیست و باید دقیقا برابر %1 کاراکتر باشد.",
        lengthmax: "طول مقدار وارد شده صحیح نیست و باید حداکثر %1 کاراکتر باشد.",
        lengthmin: "طول مقدار وارد شده صحیح نیست و باید حداقل %1 کاراکتر باشد.",
        words_min : "این بخش باید حاوی حداقل %1 کلمه باشد. %2 کلمه وارد شده.",
        words_range : "این بخش باید حاوی %1-%2 کلمه باشد. %3 کلمه وارد شده.",
        words_max : "این بخش باید حاوی حداکثر %1 کلمه باشد. %2 کلمه وارد شده.",
        checkbox: "لطفا این مورد را انتخاب کنید.",
		group: 'Please make at least %1 selection(s).',
        custom: "لطفا این گزینه را انتخاب کنید",
        select: "لطفا مقداری را انتخاب کنید"
});