jQuery.gvalidation.errors = jQuery.extend(jQuery.gvalidation.errors, {
	required: 'Το πεδίο είναι υποχρεωτικό.',
	alpha: 'Το πεδίο δέχεται μόνο αλφαβητικούς χαρακτήρες.',
	alphanum: 'Το πεδίο δέχεται μόνο αλφαρηθμιτικούς χαρακτήρες.',
	nodigit: 'Δέν επιτρέπονται αριθμοί.',
	digit: 'Παρακαλώ πληκτρολογήστε ένα έγκυρο ψηφίο.',
	digitmin: 'Ο αριθμός γραμμάτων πρέπει να είναι τουλάχιστον %1',
	digitltd: 'Η τιμή πρέπει να είναι ανάμεσα στο %1 και στο %2',
	number: 'Παρακαλώ πληκτρολογήστε ένα έγκυρο αριθμό.',
	email: 'Παρακαλώ πληκτρολογήστε έγκυρη μορφή email: Π.χ. yourname@domain.com',
	phone: 'Παρακαλώ πληκτρολογήστε έναν έγκυρο αριθμό τηλεφώνου.',
	url: 'Παρακαλώ πληκτρολογήστε μία έγκυρη διεύθυνση: Π.χ. http://www.domain.com',
	
	confirm: 'Αυτό το πεδίο είναι διαφορετικό από το %1',
	differs: 'Η τιμή πρέπει να είναι διαφορετική από %1',
	length_str: 'Το μήκος είναι λάθος, πρέπει να είναι από %1 μέχρι %2',
	lengthmax: 'Το μήκος είναι λάθος, πρέπει να είναι το πολύ %1',
	lengthmin: 'Το μήκος είναι λάθος, πρέπει να είναι το ελάχιστο %1',
	checkbox: 'Παρακαλώ τσεκάρετε το κουτί',
	group: 'Please make at least %1 selection(s).',
	custom: 'Παρακαλώ επιλέξτε ένα από τα κουμπιά',
	select: 'Παρακαλώ επιλέξτε μία τιμή'
});